200_Ahmed-body/001_Ahmed-body25/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentKE;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type  turbulentIntensityKineticEnergyInlet;
        value $internalField;
        intensity 0.0025;
    }
    
    outlet
    {
        type  inletOutlet;
        value $internalField;
        inletValue $internalField;
    }

    ground
    {
        type  kqRWallFunction;
        value $internalField;
    }
    
     AhmedGroup
    {
        type  kqRWallFunction;
        value $internalField;
    }

    #include "include/topANDside"
}

// ************************************************************************* //
