200_Ahmed-body/001_Ahmed-body25/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
	type  zeroGradient;
    }
    
    outlet
    {
        type  fixedValue;
        value $internalField;
    }

    ground
    {
	type  zeroGradient;
    }
    
    AhmedGroup
    {
        type  zeroGradient;
    }

    #include "include/topANDside"
}

// ************************************************************************* //
