200_Ahmed-body/001_Ahmed-body25/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

./Allrun_solv
./Allrun_mesh
./Allrun_plot
#------------------------------------------------------------------------------
