200_Ahmed-body/001_Ahmed-body25/Allrun_plot
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

gnuplot gnuplot/004_plotUpng.gp
#------------------------------------------------------------------------------
