200_Ahmed-body/001_Ahmed-body25/system/continuityError
    continuityError1
    {
        type continuityError;
        libs
        (
            fieldFunctionObjects
        ); 	// Mandatory entries (unmodifiable)// Optional entries (runtime modifiable)
        phi phi; 	// Optional (inherited) entries
        writePrecision 8;
        writeToFile yes;
        useUserTime yes;
        region region0;
        enabled yes;
        log yes;
        timeStart 0;
        timeEnd 6000;
        executeControl timeStep;
        executeInterval 1;
        writeControl timeStep;
        writeInterval 50;
    }